### Dados absolutos e Relativos

#### Dado absoluto: Contagem, sem qualquer tipo de manipulação

#### Dado relativo: Ajudam nas comparações entre as quantidades
##### 1 podemos usar porcentagem
##### 2 indices
##### 3 coeficientes
##### 4 taxas

In [1]:
import pandas as pd

In [2]:
dados = {'emprego':['Administrador de Banco de Dados', 'Programador', 'Arquiteto de Redes'],
        'nova_jersey':[97350, 82080, 112840],
        'florida':[77140, 71540, 62310]}

In [4]:
dados = pd.DataFrame(dados)
display(dados)

                           emprego  nova_jersey  florida
0  Administrador de Banco de Dados        97350    77140
1                      Programador        82080    71540
2               Arquiteto de Redes       112840    62310

In [6]:
dados['nova_jersey'].sum(), dados['florida'].sum() ## somando os valores da coluna

(292270, 210990)

In [7]:
dados['%_nova_jersey'] = (dados['nova_jersey'] / dados['nova_jersey'].sum()) * 100

In [8]:
dados

                           emprego  nova_jersey  florida  %_nova_jersey
0  Administrador de Banco de Dados        97350    77140      33.308242
1                      Programador        82080    71540      28.083621
2               Arquiteto de Redes       112840    62310      38.608136

In [11]:
dados['%_florida'] = (dados['florida'] / dados['florida'].sum()) * 100

In [12]:
dados

,emprego,nova_jersey,florida,%_nova_jersey,%_florida
0,Administrador de Banco de Dados,97350,77140,33.308242,36.560974
1,Programador,82080,71540,28.083621,33.906820
2,Arquiteto de Redes,112840,62310,38.608136,29.532205

In [13]:
dados['nova_jersey'].mean(), dados['florida'].mean() ## média dos valores da coluna

(97423.33333333333, 70330.0)

In [14]:
dados['%_nova_jersey'].mean(), dados['%_florida'].mean() ## somando os valores da coluna

(33.333333333333336, 33.333333333333336)

#### Exercício

In [42]:
censu = pd.read_csv('../Bases de dados/census.csv')
censu.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [43]:
censu = censu[['education', 'income']]

In [44]:
display(censu)

         education  income
0        Bachelors   <=50K
1        Bachelors   <=50K
2          HS-grad   <=50K
3             11th   <=50K
4        Bachelors   <=50K
...            ...     ...
32556   Assoc-acdm   <=50K
32557      HS-grad    >50K
32558      HS-grad   <=50K
32559      HS-grad   <=50K
32560      HS-grad    >50K

[32561 rows x 2 columns]

In [45]:
censu = censu.groupby(['education', 'income'])['education'].count()

In [46]:
censu

education      income
 10th           <=50K     871
                >50K       62
 11th           <=50K    1115
                >50K       60
 12th           <=50K     400
                >50K       33
 1st-4th        <=50K     162
                >50K        6
 5th-6th        <=50K     317
                >50K       16
 7th-8th        <=50K     606
                >50K       40
 9th            <=50K     487
                >50K       27
 Assoc-acdm     <=50K     802
                >50K      265
 Assoc-voc      <=50K    1021
                >50K      361
 Bachelors      <=50K    3134
                >50K     2221
 Doctorate      <=50K     107
                >50K      306
 HS-grad        <=50K    8826
                >50K     1675
 Masters        <=50K     764
                >50K      959
 Preschool      <=50K      51
 Prof-school    <=50K     153
                >50K      423
 Some-college   <=50K    5904
                >50K     1387
Name: education, dtype: int64

In [47]:
censu.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [52]:
censu[' Bachelors', ' <=50K'], censu[' Bachelors', ' >50K']

(3134, 2221)

In [53]:
3134 + 2221

5355

In [54]:
(2221 / 5355) * 100

41.47525676937442

In [55]:
(3134 / 5355) * 100

58.52474323062559